// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
const NAME = "이정론";
// - 나이(변수)
let age = 29;
// - 학생 여부(상수)
const IS_STUDENT = true;
// - 모든 정보를 한 번에 출력해보세요.
console.log(`이름: ${NAME}, 나이: ${age}, 학생 여부: ${IS_STUDENT}`);

// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const FIRST_NUMBER = 15;
// - 숫자2(상수)
const SECOND_NUMBER = 4;
// - 결과(변수)
console.log("숫자1 + 숫자2 :", FIRST_NUMBER + SECOND_NUMBER);

// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const PRODUCT_NAME = "아이폰";
// - 가격(변수)
let productPrice = 1200000;
// - 재고 있음(변수)
let isInStock = true;
// - 할인율(상수)
const DISCOUNT_RATE = 0.1;

console.log(
  `상품명: ${PRODUCT_NAME}, 가격: ${productPrice}, 재고 있음: ${isInStock}, 할인율: ${DISCOUNT_RATE}`
);
